export {};

/*
  📌 인터페이스(Interface)
  1. 인터페이스는 객체의 구조를 정의하는 강력한 타입 선언 방식
  2. 코드상의 객체가 가져야 할 프로퍼티와 메서드를 명시적으로 정의
  3. 타입 별칭(type alias)와 비슷하지만, 
     인터페이스는 선언 병합(중복 선언 후 확장)이 가능하고 클래스와 연동이 잘 됨
  4. 작성법
     interface 인터페이스명 {
       프로퍼티: 타입;
       메서드: 타입;
     }
*/

/*
  📌 인터페이스 확장 (Interface Extension)
  1. 인터페이스는 extends 키워드를 사용하여 확장 가능
  2. 확장된 인터페이스는 기존 인터페이스의 모든 프로퍼티와 메서드를 상속받음
  3. 확장된 인터페이스는 기존 인터페이스의 프로퍼티와 메서드를 추가로 정의할 수 있음
  4. 작성법
     interface 인터페이스명 extends 인터페이스명 {
       프로퍼티: 타입;
       메서드: 타입;
     }
*/
interface User {
  id: number;
  name: string;
  email?: string;
}
interface Student extends User {
  grade: number;
}

const stu1: Student = {
  id: 3,
  name: "강재순",
  email: "33@",
  grade: 5,
};

/*
  📌 인터페이스 선언 병합 (Interface Merging)
  1. 인터페이스는 선언 병합이 가능
  2. 동일 이름의 인터페이스가 여러 개 있을 경우 병합됨
*/

interface Person {
  name: string;
}

interface Person {
  age: number;
}

// 같은 변수 interface  추가 선언 = 두개 합친 병합 선언됨
const stu3: Person = {
  name: "엄마",
  age: 33,
};

/** 
 * Type Alias vs Interface
 * 공통: 객체의 타입을 정의하는데 사용
 * 차이 - Type Alias : , 병합 (동일 이름의 타입 별칭 선언) 불가 / 확장(extends 물려주기) 불가 단 Intersection 으로 대체 가능

권장
1.  Interface 사용관장
API 응답 데이터, REACT 컴포넌트 의 props 등 객체구조 정의사에
- extends 확장이 더 직관 + 병합기능 유연성
=> 기존 라이브러리에서 정의된 인터페이스에 추가 속성 붙일 때 유래

2. Type Alias 사용 권장
유니언 타입 정으시ㅣ , 원시값에 의미 부여시, 튜플 정의사, 복잡한 타입 정의 시

 * 
 */
