export {};

/*
  📌 변수 선언 및 초기화 
  1. 타입스크립트에서는 변수 선언 시 타입을 명시적으로 지정해야 함
  2. 작성법
    let|const 변수명: 타입 = 값;
  3. 타입을 명시하지 않을 경우 유의사항 
    1) 변수 선언 시    : any 타입으로 추론됨
    2) 특정 값 할당 시 : 해당 값의 타입으로 추론됨
*/

/*
  📌 기본 타입 (Primitive Types)
  1. 원시 값을 표현하는 타입
  2. 종류
    1) number
    2) string
    3) boolean
    4) null
    5) undefined
    6) symbol
    7) bigint
*/

let num: number;
num = 10;

// num = '123';

let str: string;
str = `hello${num}`;
//str = 10 x null x undefined x // 타입이 맞지 않으면 개발단계에서 오류를 표시함

let bool: boolean;
bool = false;
// bool = 0,1 도 안됨

let nul: null;
nul = null;
// nul = undefined 안됨, 반내 경우도 안됨

let big: bigint;
big = 1234565465131321654687132135464651323n; // bigint = 숫자끝에n
